project/app/views/orders/index.html.erb

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 12]]
---
        <% @orders.each do |order| %>
          <% @order_details = OrderDetail.where(order_id: order.id) %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
              <div class="col-md-1 column text-center">
                <% @user = User.find(order.user_id) %>

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "product_features".* FROM "product_features" WHERE "product_features"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% @order_details.each do |order_detail|  %>
                  <% @product_feature = ProductFeature.find(order_detail.product_feature_id) %>
                  <% @product = Product.find(@product_feature.product_id) %>

SELECT "product_features".* FROM "product_features" WHERE "product_features"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% @order_details.each do |order_detail|  %>
                  <% @product_feature = ProductFeature.find(order_detail.product_feature_id) %>
                  <% @product = Product.find(@product_feature.product_id) %>