project/app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("user_id", "product_feature_id", "num", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["product_feature_id", 4], ["num", 2], ["created_at", "2022-12-31 08:10:00.623392"], ["updated_at", "2022-12-31 08:10:00.623392"]]

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

  def myUpdate
    @cart = Cart.find(params[:cart_id])
    @product = Product.find(params[:product_id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 10]]

  def myDestroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]