project/app/controllers/collects_controller.rb

SELECT "collects".* FROM "collects"
---
  def index
    @collects = Collect.all

INSERT INTO "collects" ("user_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["product_id", 1], ["created_at", "2022-12-31 02:31:50.654726"], ["updated_at", "2022-12-31 02:31:50.654726"]]
---
  def create
    @collect = Collect.new(collect_params)

    respond_to do |format|
      if @collect.save

DELETE FROM "collects" WHERE "collects"."id" = ?  [["id", 1]]
---
  def destroy
    @collect.destroy

SELECT "collects".* FROM "collects" WHERE "collects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_collect
      @collect = Collect.find(params[:id])