project/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
---
  def index
    if current_user.status == 0
      @orders = Order.where(user_id: current_user.id)
    else
      @orders = Order.all

INSERT INTO "orders" ("real_name", "address", "telephone", "post_code", "status", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "order_details" ("product_feature_id", "num", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_feature_id", 3], ["num", 1], ["order_id", 1], ["created_at", "2023-01-02 02:57:02.407958"], ["updated_at", "2023-01-02 02:57:02.407958"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 3]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
        price = 0
        params[:cart_id].each do |cart_id|
          @cart = Cart.find(cart_id)
          @order_detail = OrderDetail.new(product_feature_id: @cart.product_feature_id, num: @cart.num, order_id: @order.id)
          @order_detail.save
          @product = Product.find_by_sql(
              "SELECT products.* FROM products
               INNER JOIN product_features ON products.id = product_features.product_id
               INNER JOIN carts ON product_features.id = carts.product_feature_id
               WHERE carts.id = #{@cart.id}").first
          @product.sales = @product.sales + @cart.num
          @product.save
          @cart.destroy

UPDATE "orders" SET "price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["price", 820.9], ["updated_at", "2023-01-02 02:57:02.459221"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 11]]
DELETE FROM "order_details" WHERE "order_details"."id" = ?  [["id", 9]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 11]]
---
  def destroy
    @order_details = OrderDetail.where(order_id: @order.id)
    @order_details.each do |order_detail|
      order_detail.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 4], ["updated_at", "2023-01-01 12:35:05.353954"], ["id", 12]]
---
  def updateStatus
    @order = Order.find(params[:order_id])
    @order.status = params[:status]
    @order.save