project/app/controllers/orders_controller.rb

UPDATE "orders" SET "price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["price", 159.0], ["updated_at", "2023-01-01 07:16:05.488735"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)