project/app/controllers/products_controller.rb

  def index
    @products = Product.all.order("status ASC").order("created_at DESC")
---
SELECT "products".* FROM "products" ORDER BY status ASC, created_at DESC

  def show
    if user_signed_in?
      @collect = Collect.find_by(user_id: current_user.id, product_id: @product.id)
---
SELECT "collects".* FROM "collects" WHERE "collects"."user_id" = ? AND "collects"."product_id" = ? LIMIT ?  [["user_id", 1], ["product_id", 10], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    @product.save

    uploaded_io = params[:product][:picture]
    file_name = Digest::MD5.hexdigest(@product.id.to_s + uploaded_io.original_filename) + ".png"
    File.open(Rails.root.join('app', 'assets', 'images', 'product', file_name), 'wb') do |file|
      file.write(uploaded_io.read)
    end
    @product.url = "product/" + file_name
    @product.save

    params[:feature_name].each do |feature_name|
      @product_feature = ProductFeature.new(feature_name: feature_name, product_id: @product.id)
      @product_feature.save
---
INSERT INTO "products" ("product_name", "detail", "price", "sales", "url", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "product_features" ("feature_name", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["feature_name", "M"], ["product_id", 8], ["created_at", "2023-01-02 16:26:05.757142"], ["updated_at", "2023-01-02 16:26:05.757142"]]

  def update
    uploaded_io = params[:product][:picture]
    file_name = Digest::MD5.hexdigest(@product.id.to_s + uploaded_io.original_filename) + ".png"
    File.open(Rails.root.join('app', 'assets', 'images', 'product', file_name), 'wb') do |file|
      file.write(uploaded_io.read)
    end
    @product.url = "product/" + file_name
    @product.save

    @product.update(product_params)

    @product.product_features.each do |product_feature|
      product_feature.destroy
    end

    params[:feature_name].each do |feature_name|
      @product_feature = ProductFeature.new(feature_name: feature_name, product_id: @product.id)
      @product_feature.save
---
UPDATE "products" SET "url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["url", "product/812749e1a307f38fd0a88b54bea55ff2.png"], ["updated_at", "2023-01-02 17:22:03.239763"], ["id", 12]]
UPDATE "products" SET "product_name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_name", "拉夏贝尔奶杏色羊羔绒圆领卫衣女加绒2022年新款冬季超厚无帽外套女款衣服大码"], ["updated_at", "2023-01-02 19:25:48.768345"], ["id", 1]]
SELECT "product_features".* FROM "product_features" WHERE "product_features"."product_id" = ?  [["product_id", 12]]
DELETE FROM "product_features" WHERE "product_features"."id" = ?  [["id", 10]]
INSERT INTO "product_features" ("feature_name", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["feature_name", "M"], ["product_id", 12], ["created_at", "2023-01-02 17:22:03.262914"], ["updated_at", "2023-01-02 17:22:03.262914"]]

  def search
    @products = Product.where("product_name LIKE '%#{params[:keyword]}%'").order("status ASC").order("created_at DESC")
---
SELECT "products".* FROM "products" WHERE (product_name LIKE '%商品%') ORDER BY status ASC, created_at DESC

  def updateStatus
    @product = Product.find(params[:product_id])
    @product.status = params[:status]
    @product.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "products" SET "status" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["status", 1], ["updated_at", "2023-01-02 17:36:56.496604"], ["id", 12]]