project/app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["url", "/Users/wangxinyuan/Desktop/笔记/1 Ruby/19241035/project/product/1631dd5e6c9cb7c8d5a55eb06a361a19"], ["updated_at", "2023-01-02 16:26:05.712867"], ["id", 8]]