project/app/controllers/welcome_controller.rb

SELECT "products".* FROM "products" ORDER BY status ASC, created_at DESC
---
  def index
    @products = Product.all.order("status ASC").order("sales DESC")

SELECT COUNT(*) FROM "collects" WHERE "collects"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 2]]
SELECT "products".* FROM "products"
---
  def center
    @collect_cnt = Collect.where(user_id: current_user.id).count
    @cart_cnt = Cart.where(user_id: current_user.id).count
    @order_cnt = Order.where(user_id: current_user.id).count
    @product_id = if Product.all.length == 0