project/app/views/carts/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."product_feature_id" = ? LIMIT ?  [["user_id", 2], ["product_feature_id", 1], ["LIMIT", 1]]
---
        <% @items.each do |item| %>
          <% @product = Product.find(item.product_id) %>
          <% @cart = Cart.find_by(user_id: current_user.id, product_feature_id: item.product_feature_id) %>