project/app/views/carts/index.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."product_feature_id" = ? LIMIT ?  [["user_id", 1], ["product_feature_id", 1], ["LIMIT", 1]]
---
            <% @product = Product.find(item.product_id) %>
            <% @cart = Cart.find_by(user_id: current_user.id, product_feature_id: item.product_feature_id) %>