project/app/views/collects/index.html.erb

                <%= link_to "详情", product, class:"btn btn-primary pull-left"%>
                <% @collect = Collect.find_by(user_id: current_user.id, product_id: product.id) %>
---
SELECT "collects".* FROM "collects" WHERE "collects"."user_id" = ? AND "collects"."product_id" = ? LIMIT ?  [["user_id", 2], ["product_id", 3], ["LIMIT", 1]]