blog4/app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("blog_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["blog_id", 1], ["content", "hhh"], ["created_at", "2022-12-27 03:14:29.914493"], ["updated_at", "2022-12-27 03:14:29.914493"]]
---
  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params)
    @comment.blog = @blog

    respond_to do |format|
      if @comment.save