project/app/views/products/edit.html.erb

SELECT "product_features".* FROM "product_features" WHERE "product_features"."product_id" = ?  [["product_id", 12]]
---
          </div>
          <% size = @product.product_features.length %>